# Database Admin 101 - Lab

## Introduction 

In this lab, you'll go through the process of designing and creating a database. From there, you'll begin to populate this table with mock data provided to you.

## Objectives

You will be able to:

* Use knowledge of the structure of databases to create a database and populate it

## The Scenario

You are looking to design a database for a school that will house various information from student grades to contact information, class roster lists and attendance. First, think of how you would design such a database. What tables would you include? What columns would each table have? What would be the primary means to join said tables?

## Creating the Database

Now that you've put a little thought into how you might design your database, it's time to go ahead and create it! Start by import the necessary packages. Then, create a database called **school.sqlite**.

In [1]:
# Import necessary packages
import sqlite3
import pandas as pd

In [2]:
# Create the database school.sqlite 
conn = sqlite3.connect("school.sqlite")
cur = conn.cursor()

In [3]:
cur.execute('''DROP TABLE contactInfo;''')

In [4]:
cur.execute('''DROP TABLE my_list;''')

OperationalError: no such table: my_list

## Create a Table for Contact Information

Create a table called contactInfo to house contact information for both students and staff. Be sure to include columns for first name, last name, role (student/staff), telephone number, street, city, state, and zipcode. Be sure to also create a primary key for the table.

In [7]:
# Your code here
cur.execute("""CREATE TABLE contactInfo (
                ID INTEGER PRIMARY KEY,
                first_name TEXT,
                last_name TEXT,
                role TEXT,
                telephone INTEGER,
                street TEXT,
                city TEXT,
                state TEXT,
                zipcode TEXT)
                """)

OperationalError: table contactInfo already exists

In [6]:
cur.execute("""SELECT name FROM sqlite_master WHERE type = 'table';""").fetchall()

[('grades',), ('contactInfo',)]

In [8]:
cur.execute("""PRAGMA table_info(contactInfo);""").fetchall()

[(0, 'ID', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'TEXT', 0, None, 0),
 (2, 'last_name', 'TEXT', 0, None, 0),
 (3, 'role', 'TEXT', 0, None, 0),
 (4, 'telephone', 'INTEGER', 0, None, 0),
 (5, 'street', 'TEXT', 0, None, 0),
 (6, 'city', 'TEXT', 0, None, 0),
 (7, 'state', 'TEXT', 0, None, 0),
 (8, 'zipcode', 'TEXT', 0, None, 0)]

## Populate the Table

Below, code is provided for you in order to load a list of dictionaries. Briefly examine the list. Each dictionary in the list will serve as an entry for your contact info table. Once you've briefly investigated the structure of this data, write a for loop to iterate through the list and create an entry in your table for each person's contact info.

In [9]:
ls

contact_list.pickle  index.ipynb  README.md
CONTRIBUTING.md      LICENSE.md   school.sqlite

In [10]:
# Load the list of dictionaries; just run this cell
import pickle

with open('contact_list.pickle', 'rb') as f:
    contacts = pickle.load(f)
contacts

[{'firstName': 'Christine',
  'lastName': 'Holden',
  'role': 'staff',
  'telephone ': 2035687697,
  'street': '1672 Whitman Court',
  'city': 'Stamford',
  'state': 'CT',
  'zipcode ': '06995'},
 {'firstName': 'Christopher',
  'lastName': 'Warren',
  'role': 'student',
  'telephone ': 2175150957,
  'street': '1935 University Hill Road',
  'city': 'Champaign',
  'state': 'IL',
  'zipcode ': '61938'},
 {'firstName': 'Linda',
  'lastName': 'Jacobson',
  'role': 'staff',
  'telephone ': 4049446441,
  'street': '479 Musgrave Street',
  'city': 'Atlanta',
  'state': 'GA',
  'zipcode ': '30303'},
 {'firstName': 'Andrew',
  'lastName': 'Stepp',
  'role': 'student',
  'telephone ': 7866419252,
  'street': '2981 Lamberts Branch Road',
  'city': 'Hialeah',
  'state': 'Fl',
  'zipcode ': '33012'},
 {'firstName': 'Jane',
  'lastName': 'Evans',
  'role': 'student',
  'telephone ': 3259909290,
  'street': '1461 Briarhill Lane',
  'city': 'Abilene',
  'state': 'TX',
  'zipcode ': '79602'},
 {'firstName': 'Jane',
  'lastName': 'Evans',
  'role': 'student',
  'telephone ': 3259909290,
  'street': '1461 Briarhill Lane',
  'city': 'Abilene',
  'state': 'TX',
  'zipcode ': '79602'},
 {'firstName': 'Mary',
  'lastName': 'Raines',
  'role': 'student',
  'telephone ': 9075772295,
  'street': '3975 Jerry Toth Drive',
  'city': 'Ninilchik',
  'state': 'AK',
  'zipcode ': '99639'},
 {'firstName': 'Ed',
  'lastName': 'Lyman',
  'role': 'student',
  'telephone ': 5179695576,
  'street': '3478 Be Sreet',
  'city': 'Lansing',
  'state': 'MI',
  'zipcode ': '48933'}]

In [12]:
# Iterate over the contact list and populate the contactInfo table here
for contact in contacts:
    cur.execute('''INSERT INTO contactInfo (first_name, last_name, role, telephone, street, city, state, zipcode) 
                      VALUES (?,?,?,?,?,?,?,?)''', (contact['firstName'], contact['lastName'], 
                                                    contact['role'], contact['telephone '], 
                                                    contact['street'], contact['city'], contact['state'], 
                                                    contact['zipcode '])
               )

**Query the Table to Ensure it is populated**

In [13]:
# Query the table 
cur.execute("""SELECT * FROM contactInfo;""").fetchall()

[(1,
  'Christine',
  'Holden',
  'staff',
  2035687697,
  '1672 Whitman Court',
  'Stamford',
  'CT',
  '06995'),
 (2,
  'Christopher',
  'Warren',
  'student',
  2175150957,
  '1935 University Hill Road',
  'Champaign',
  'IL',
  '61938'),
 (3,
  'Linda',
  'Jacobson',
  'staff',
  4049446441,
  '479 Musgrave Street',
  'Atlanta',
  'GA',
  '30303'),
 (4,
  'Andrew',
  'Stepp',
  'student',
  7866419252,
  '2981 Lamberts Branch Road',
  'Hialeah',
  'Fl',
  '33012'),
 (5,
  'Jane',
  'Evans',
  'student',
  3259909290,
  '1461 Briarhill Lane',
  'Abilene',
  'TX',
  '79602'),
 (6,
  'Jane',
  'Evans',
  'student',
  3259909290,
  '1461 Briarhill Lane',
  'Abilene',
  'TX',
  '79602'),
 (7,
  'Mary',
  'Raines',
  'student',
  9075772295,
  '3975 Jerry Toth Drive',
  'Ninilchik',
  'AK',
  '99639'),
 (8,
  'Ed',
  'Lyman',
  'student',
  5179695576,
  '3478 Be Sreet',
  'Lansing',
  'MI',
  '48933')]

## Commit Your Changes to the Database

Persist your changes by committing them to the database.

In [14]:
# Your code here
conn.commit()

## Create a Table for Student Grades

Create a new table in the database called "grades". In the table, include the following fields: userId, courseId, grade.

** This problem is a bit more tricky and will require a dual key. (A nuance you have yet to see.)
Here's how to do that:

```SQL
CREATE TABLE table_name(
   column_1 INTEGER NOT NULL,
   column_2 INTEGER NOT NULL,
   ...
   PRIMARY KEY(column_1,column_2,...)
);
```

In [15]:
# Create the grades table
cur.execute("""CREATE TABLE grades (
                                    userId INTEGER NOT NULL,
                                    courseId INTEGER NOT NULL,
                                    grade TEXT,
                                    PRIMARY KEY (userId, courseId)
                                    )
            """)

OperationalError: table grades already exists

## Remove Duplicate Entries

An analyst just realized that there is a duplicate entry in the contactInfo table! Find and remove it.

In [17]:
# Find the duplicate entry
cur.execute("""SELECT first_name, last_name, role, telephone, street, city, state, zipcode 
                FROM contactInfo GROUP BY first_name, last_name, role, telephone, street, city, state, zipcode
                HAVING COUNT(ID)>1;""").fetchall()

[('Jane',
  'Evans',
  'student',
  3259909290,
  '1461 Briarhill Lane',
  'Abilene',
  'TX',
  '79602')]

In [17]:
cur.execute("""SELECT *
                FROM contactInfo GROUP BY first_name, last_name, role, telephone, street, city, state, zipcode
                HAVING COUNT(ID)>1;""").fetchall()

[(5,
  'Jane',
  'Evans',
  'student',
  3259909290,
  '1461 Briarhill Lane',
  'Abilene',
  'TX',
  '79602')]

In [18]:
query_list= cur.execute("""SELECT * FROM contactInfo;""").fetchall()
for query in query_list:
    print(query[1])

Christine
Christopher
Linda
Andrew
Jane
Jane
Mary
Ed

In [19]:
# Delete the duplicate entry
cur.execute('''DELETE FROM contactInfo WHERE rowid NOT IN (SELECT min(rowid) FROM contactInfo GROUP BY first_name)''')

In [20]:
# Check that the duplicate entry was removed
cur.execute("""SELECT * FROM contactInfo;""").fetchall()

[(1,
  'Christine',
  'Holden',
  'staff',
  2035687697,
  '1672 Whitman Court',
  'Stamford',
  'CT',
  '06995'),
 (2,
  'Christopher',
  'Warren',
  'student',
  2175150957,
  '1935 University Hill Road',
  'Champaign',
  'IL',
  '61938'),
 (3,
  'Linda',
  'Jacobson',
  'staff',
  4049446441,
  '479 Musgrave Street',
  'Atlanta',
  'GA',
  '30303'),
 (4,
  'Andrew',
  'Stepp',
  'student',
  7866419252,
  '2981 Lamberts Branch Road',
  'Hialeah',
  'Fl',
  '33012'),
 (5,
  'Jane',
  'Evans',
  'student',
  3259909290,
  '1461 Briarhill Lane',
  'Abilene',
  'TX',
  '79602'),
 (7,
  'Mary',
  'Raines',
  'student',
  9075772295,
  '3975 Jerry Toth Drive',
  'Ninilchik',
  'AK',
  '99639'),
 (8,
  'Ed',
  'Lyman',
  'student',
  5179695576,
  '3478 Be Sreet',
  'Lansing',
  'MI',
  '48933')]

## Updating an Address

Ed Lyman just moved to `2910 Simpson Avenue York, PA 17403`. Update his address accordingly.

In [27]:
# Update Ed's address
cur.execute('''UPDATE contactInfo 
                SET street = '2910 Simpson Avenue', city = 'York', state = 'PA', zipcode = '17403'
                WHERE first_name = 'Ed';
            ''')

In [21]:
# Query the database to ensure the change was made
cur.execute('''SELECT * FROM contactInfo WHERE first_name = 'Ed';''').fetchall()

[(8,
  'Ed',
  'Lyman',
  'student',
  5179695576,
  '3478 Be Sreet',
  'Lansing',
  'MI',
  '48933')]

## Commit Your Changes to the Database

Once again, persist your changes by committing them to the database.

In [22]:
# Your code here
conn.commit()

## Summary

While there's certainly more to do with setting up and managing this database, you got a taste for creating, populating, and maintaining databases! Feel free to continue fleshing out this exercise for more practice.